starliliko/diy-drone-powered-by-esp32s3/components/core/crazyflie/hal/src/sensors_bmi088_spi_ms5611.c
static bool processGyroBias(int16_t gx, int16_t gy, int16_t gz, Axis3f *gyroBiasOut);
static bool processAccScale(int16_t ax, int16_t ay, int16_t az);
#ifdef GYRO_DYNAMIC_CALIBRATION_ENABLED
static void gyroDynamicCalibUpdate(int16_t gx, int16_t gy, int16_t gz, bool quadIsFlying);
#endif
static void sensorsBiasObjInit(BiasObj *bias);
static void sensorsCalculateVarianceAndMean(BiasObj *bias, Axis3f *varOut, Axis3f *meanOut);
static void sensorsAddBiasValue(BiasObj *bias, int16_t x, int16_t y, int16_t z);
static bool sensorsFindBiasValue(BiasObj *bias);
static void sensorsAccAlignToGravity(Axis3f *in, Axis3f *out);
static void applyAxis3fLpf(lpf2pData *data, Axis3f *in);
static void applyAxis3fGyroFilters(Axis3f *in);
static void applyAxis3fAccelFilters(Axis3f *in);
static void refreshImuFilterConfig(void);
static void sensorsDeviceInit(void);
static void sensorsInterruptInit(void);
static void sensorsScaleBaro(baro_t *baroScaled);

STATIC_MEM_TASK_ALLOC(sensorsTask, SENSORS_TASK_STACKSIZE); // 静态内存分配任务

bool sensorsBmi088SpiMs5611ReadGyro(Axis3f *gyro)
{
    return (pdTRUE == xQueueReceive(gyroDataQueue, gyro, 0));
}

bool sensorsBmi088SpiMs5611ReadAcc(Axis3f *acc)
{
    return (pdTRUE == xQueueReceive(accelerometerDataQueue, acc, 0));
}

bool sensorsBmi088SpiMs5611ReadMag(Axis3f *mag)
{
    return (pdTRUE == xQueueReceive(magnetometerDataQueue, mag, 0));
}

bool sensorsBmi088SpiMs5611ReadBaro(baro_t *baro)
{
    return (pdTRUE == xQueueReceive(barometerDataQueue, baro, 0));
}
/* 传感器数据获取函数
   从各个传感器读取数据并存储到传感器数据结构体中
*/
// 底层仍然是调用xQueueReceive
void sensorsBmi088SpiMs5611Acquire(sensorData_t *sensors, const uint32_t tick)
{
    sensorsReadGyro(&sensors->gyro);
    sensorsReadAcc(&sensors->acc);
    sensorsReadMag(&sensors->mag);
    sensorsReadBaro(&sensors->baro);
    sensors->interruptTimestamp = sensorData.interruptTimestamp;
}

bool sensorsBmi088SpiMs5611AreCalibrated(void) // 传感器校准状态检查函数
{
    return gyroBiasFound;
}

static void sensorsTask(void *param)
{
    systemWaitStart();

    vTaskDelay(M2T(200)); // 200ms等待系统稳定

    // sensorsDeviceInit(); // 传感器设备初始化

    Axis3f accScaled;

    uint32_t interruptCount = 0;
    while (1)
    {
        if (pdTRUE == xSemaphoreTake(sensorsDataReady, M2T(1000))) // 1秒超时
        {
            refreshImuFilterConfig();
            interruptCount++;
            sensorData.interruptTimestamp = imuIntTimestamp;

            // ========================================
            // FIX: Check data-ready flags to prevent double-processing
            // ========================================
            // ACC INT and GYRO INT both give the SAME binary semaphore.
            // Without flag check, EVERY wakeup reads+processes BOTH sensors,
            // causing the gyro LPF to process each raw sample TWICE.
            // This distorts the biquad filter state, effectively doubling
            // the noise bandwidth (80Hz designed → ~160Hz actual).
            bool newGyro = bmi088GyroDataReady;
            bool newAccel = bmi088AccDataReady;

            // Read SPI only for sensors with new data
            int16_t raw_gx, raw_gy, raw_gz;
            int16_t raw_ax, raw_ay, raw_az;
            if (newGyro) {
                bmi088GyroDataReady = false;
                bmi088_get_gyro_data(&raw_gx, &raw_gy, &raw_gz);
                gyroRaw.x = raw_gx;
                gyroRaw.y = raw_gy;
                gyroRaw.z = raw_gz;
            }
            if (newAccel) {
                bmi088AccDataReady = false;
                bmi088_get_accel_data(&raw_ax, &raw_ay, &raw_az);
                accelRaw.x = raw_ax;
                accelRaw.y = raw_ay;
                accelRaw.z = raw_az;
            }

            // Re-enable interrupts after SPI read complete
            gpio_intr_enable(BMI088_INT1_PIN);
            gpio_intr_enable(BMI088_INT3_PIN);

            // Process gyro data (only when fresh sample available)
            if (newGyro) {
                gyroBiasFound = processGyroBias(gyroRaw.x, gyroRaw.y, gyroRaw.z, &gyroBias);
                if (gyroBiasFound) {
                    gyroDynamicCalibUpdate(gyroRaw.x, gyroRaw.y, gyroRaw.z, quadIsFlying);
                }

                sensorData.gyro.x = -(gyroRaw.y - gyroBias.y) * SENSORS_BMI088_DEG_PER_LSB_CFG;
                sensorData.gyro.y = (gyroRaw.x - gyroBias.x) * SENSORS_BMI088_DEG_PER_LSB_CFG;
                sensorData.gyro.z = -(gyroRaw.z - gyroBias.z) * SENSORS_BMI088_DEG_PER_LSB_CFG;
                applyAxis3fGyroFilters(&sensorData.gyro);
            }

            // Process accel data (only when fresh sample available)
            if (newAccel) {
                if (gyroBiasFound) {
                    processAccScale(accelRaw.x, accelRaw.y, accelRaw.z);
                }
                accScaled.x = -accelRaw.y * SENSORS_BMI088_G_PER_LSB_CFG / accScale;
                accScaled.y = accelRaw.x * SENSORS_BMI088_G_PER_LSB_CFG / accScale;
                accScaled.z = accelRaw.z * SENSORS_BMI088_G_PER_LSB_CFG / accScale;
                sensorsAccAlignToGravity(&accScaled, &sensorData.acc);
                applyAxis3fAccelFilters(&sensorData.acc);
            }
        }

        // 读取气压计数据
        if (isBarometerPresent)
        {
            static uint8_t baroMeasDelay = SENSORS_DELAY_BARO;
            if (--baroMeasDelay == 0)
            {
                sensorsScaleBaro(&sensorData.baro);
                baroMeasDelay = baroMeasDelayMin;

                // 输出气压计数据（每秒一次，50Hz读取 = 每20次输出一次）
                // static uint8_t baroLogCount = 0;
                // if (++baroLogCount >= 50)
                // {
                //     printf("%.2f, %.2f, %.2f \n",
                //            sensorData.baro.pressure, sensorData.baro.temperature, sensorData.baro.asl);
                //     baroLogCount = 0;
                // }
            }
        }

        xQueueOverwrite(accelerometerDataQueue, &sensorData.acc);
        xQueueOverwrite(gyroDataQueue, &sensorData.gyro);
        if (isBarometerPresent)
        {
            xQueueOverwrite(barometerDataQueue, &sensorData.baro);
        }

        xSemaphoreGive(dataReady);
    }
}

void sensorsBmi088SpiMs5611WaitDataReady(void)
{
    xSemaphoreTake(dataReady, portMAX_DELAY);
}

static void sensorsDeviceInit(void)
{
    if (isInit)
        return;

    spiDrvInit(SPI_DRV_HOST_DEFAULT); // 初始化SPI
    i2cdevInit(I2C0_DEV);             // 初始化I2C

    // 等待传感器启动
    vTaskDelay(M2T(SENSORS_STARTUP_TIME_MS)); // 2秒

    // 初始化BMI088 (SPI)
    if (!bmi088_init())
    {
        DEBUG_PRINTI("BMI088 SPI init [FAIL]\n");
        isInit = false;
        return;
    }
    else
    {
        DEBUG_PRINTI("BMI088 SPI init [OK]\n");
    }

