starliliko/diy-drone-powered-by-esp32s3/components/core/crazyflie/hal/src/sensors_bmi088_spi_ms5611.c
#ifdef GYRO_DYNAMIC_CALIBRATION_ENABLED
/**
 * 陀螺仪动态校准更新函数
 * 使用低通滤波器在静止时持续更新零点偏差，适应温漂变化
 * 改进：基于陀螺仪实际数据检测静止状态，而不仅依赖飞行标志
 *
 * @param gx, gy, gz 陀螺仪原始读数（LSB）
 * @param quadIsFlying 飞行状态标志
 */
static void gyroDynamicCalibUpdate(int16_t gx, int16_t gy, int16_t gz, bool quadIsFlying)
{
    if (!gyroDynamicCalibEnabled)
    {
        return; // 动态校准未使能
    }

    // 基于陀螺仪数据判断是否静止
    // 计算陀螺仪读数与当前偏置的偏差
    float dx = (float)(gx)-gyroBias.x;
    float dy = (float)(gy)-gyroBias.y;
    float dz = (float)(gz)-gyroBias.z;

    // 角速度幅值（LSB单位），静止时应接近0
    float gyroMagnitude = sqrtf(dx * dx + dy * dy + dz * dz);

    // 静止阈值：约 5°/s 对应的 LSB 值（保守设置避免误判）
    // 2000DPS量程下：1 LSB = 2000/32768 ≈ 0.061°/s
    // 5°/s ≈ 82 LSB
    const float STATIC_THRESHOLD_LSB = 80.0f; // 约 5°/s

    static uint32_t staticCount = 0;
    const uint32_t STATIC_CONFIRM_COUNT = 800; // 约 0.8秒 @ 1kHz（充分确认静止）

    if (gyroMagnitude < STATIC_THRESHOLD_LSB)
    {
        staticCount++;
        if (staticCount > STATIC_CONFIRM_COUNT)
        {
            // 确认静止，进行偏置更新
            // 使用更大的 alpha 加速收敛（静止时可以更激进）
            float alpha = gyroDynamicCalibAlpha * 2.0f;
            gyroBias.x += alpha * dx;
            gyroBias.y += alpha * dy;
            gyroBias.z += alpha * dz;

            // 防止计数器溢出
            staticCount = STATIC_CONFIRM_COUNT + 1;
        }
    }
    else
    {
        // 运动中，重置静止计数
        staticCount = 0;
    }
}
#endif

static bool processGyroBias(int16_t gx, int16_t gy, int16_t gz, Axis3f *gyroBiasOut)
{
    sensorsAddBiasValue(&gyroBiasRunning, gx, gy, gz);

    if (!gyroBiasRunning.isBiasValueFound)
    {
        sensorsFindBiasValue(&gyroBiasRunning);
        if (gyroBiasRunning.isBiasValueFound)
        {
            soundSetEffect(SND_CALIB);
            ledseqRun(&seq_calibrated);
        }
    }

    gyroBiasOut->x = gyroBiasRunning.bias.x;
    gyroBiasOut->y = gyroBiasRunning.bias.y;
    gyroBiasOut->z = gyroBiasRunning.bias.z;

    return gyroBiasRunning.isBiasValueFound;
}

static void sensorsBiasObjInit(BiasObj *bias)
{
    bias->isBufferFilled = false;
    bias->bufHead = bias->buffer;
}

static void sensorsCalculateVarianceAndMean(BiasObj *bias, Axis3f *varOut, Axis3f *meanOut)
{
    uint32_t i;
    int64_t sum[GYRO_NBR_OF_AXES] = {0};
    int64_t sumSq[GYRO_NBR_OF_AXES] = {0};

    for (i = 0; i < SENSORS_NBR_OF_BIAS_SAMPLES; i++)
    {
        sum[0] += bias->buffer[i].x;
        sum[1] += bias->buffer[i].y;
        sum[2] += bias->buffer[i].z;
        sumSq[0] += bias->buffer[i].x * bias->buffer[i].x;
        sumSq[1] += bias->buffer[i].y * bias->buffer[i].y;
        sumSq[2] += bias->buffer[i].z * bias->buffer[i].z;
    }

    // 方差公式: Var = [Σx² - (Σx)²/N] / N
    // 注意：必须用浮点运算，避免整数除法截断导致负方差
    varOut->x = ((float)sumSq[0] - ((float)sum[0] * (float)sum[0]) / SENSORS_NBR_OF_BIAS_SAMPLES) / SENSORS_NBR_OF_BIAS_SAMPLES;
    varOut->y = ((float)sumSq[1] - ((float)sum[1] * (float)sum[1]) / SENSORS_NBR_OF_BIAS_SAMPLES) / SENSORS_NBR_OF_BIAS_SAMPLES;
    varOut->z = ((float)sumSq[2] - ((float)sum[2] * (float)sum[2]) / SENSORS_NBR_OF_BIAS_SAMPLES) / SENSORS_NBR_OF_BIAS_SAMPLES;

    meanOut->x = (float)sum[0] / SENSORS_NBR_OF_BIAS_SAMPLES;
    meanOut->y = (float)sum[1] / SENSORS_NBR_OF_BIAS_SAMPLES;
    meanOut->z = (float)sum[2] / SENSORS_NBR_OF_BIAS_SAMPLES;
}

static void sensorsAddBiasValue(BiasObj *bias, int16_t x, int16_t y, int16_t z)
{
    bias->bufHead->x = x;
    bias->bufHead->y = y;
    bias->bufHead->z = z;
    bias->bufHead++;

    if (bias->bufHead >= &bias->buffer[SENSORS_NBR_OF_BIAS_SAMPLES])
    {
        bias->bufHead = bias->buffer;
        bias->isBufferFilled = true;
    }
}

static bool sensorsFindBiasValue(BiasObj *bias)
{
    static int32_t varianceSampleTime;
    bool foundBias = false;

    if (bias->isBufferFilled)
    {
        sensorsCalculateVarianceAndMean(bias, &bias->variance, &bias->mean);

        if (bias->variance.x < GYRO_VARIANCE_THRESHOLD_X &&
            bias->variance.y < GYRO_VARIANCE_THRESHOLD_Y &&
            bias->variance.z < GYRO_VARIANCE_THRESHOLD_Z &&
            (varianceSampleTime + GYRO_MIN_BIAS_TIMEOUT_MS < xTaskGetTickCount()))
        {
            varianceSampleTime = xTaskGetTickCount();
            bias->bias.x = bias->mean.x;
            bias->bias.y = bias->mean.y;
            bias->bias.z = bias->mean.z;
            foundBias = true;
            bias->isBiasValueFound = true;
        }
    }

    return foundBias;
}

static void sensorsAccAlignToGravity(Axis3f *in, Axis3f *out)
{
    Axis3f rx;
    Axis3f ry;

    // Rotate around x-axis
    rx.x = in->x;
    rx.y = in->y * cosRoll - in->z * sinRoll;
    rx.z = in->y * sinRoll + in->z * cosRoll;

    // Rotate around y-axis
    ry.x = rx.x * cosPitch - rx.z * sinPitch;
    ry.y = rx.y;
    ry.z = -rx.x * sinPitch + rx.z * cosPitch;

    out->x = ry.x;
    out->y = ry.y;
    out->z = ry.z;
}

void sensorsBmi088SpiMs5611SetAccMode(accModes accMode)
{
    switch (accMode)
    {
    case ACC_MODE_PROPTEST:
        for (uint8_t i = 0; i < 3; i++)
        {
            lpf2pInit(&accLpf[i], SENSORS_READ_RATE_HZ, 500);
        }
        break;
    case ACC_MODE_FLIGHT:
    default:
        for (uint8_t i = 0; i < 3; i++)
        {
            lpf2pInit(&accLpf[i], SENSORS_READ_RATE_HZ, ACCEL_LPF_CUTOFF_FREQ);
        }
        break;
    }
}

static void applyAxis3fLpf(lpf2pData *data, Axis3f *in)
{
    for (uint8_t i = 0; i < 3; i++)
    {
        in->axis[i] = lpf2pApply(&data[i], in->axis[i]);
    }
}

static void applyAxis3fGyroFilters(Axis3f *in)
{
    for (uint8_t i = 0; i < 3; i++)
    {
        if (gyroNotchEnabled)
        {
            in->axis[i] = notchFilterApply(&gyroNotch[i], in->axis[i]);
        }
        in->axis[i] = lpf2pApply(&gyroLpf[i], in->axis[i]);
    }
}

static void applyAxis3fAccelFilters(Axis3f *in)
{
    for (uint8_t i = 0; i < 3; i++)
    {
        if (accNotchEnabled)
        {
            in->axis[i] = notchFilterApply(&accNotch[i], in->axis[i]);
        }
        in->axis[i] = lpf2pApply(&accLpf[i], in->axis[i]);
    }
}

static void refreshImuFilterConfig(void)
{
    const bool gyroChanged =
        gyroNotchEnabledApplied != gyroNotchEnabled ||
        fabsf(gyroNotchCenterFreqApplied - gyroNotchCenterFreq) > 0.01f ||
        fabsf(gyroNotchBandwidthApplied - gyroNotchBandwidth) > 0.01f;

    if (gyroChanged)
    {
        for (uint8_t i = 0; i < 3; i++)
        {
            lpf2pInit(&gyroLpf[i], SENSORS_READ_RATE_HZ, GYRO_LPF_CUTOFF_FREQ);
            notchFilterInit(&gyroNotch[i], SENSORS_READ_RATE_HZ, gyroNotchCenterFreq, gyroNotchBandwidth);
        }

        gyroNotchEnabledApplied = gyroNotchEnabled;
        gyroNotchCenterFreqApplied = gyroNotchCenterFreq;
        gyroNotchBandwidthApplied = gyroNotchBandwidth;
    }

