starliliko/diy-drone-powered-by-esp32s3/components/core/crazyflie/hal/src/sensors_bmi088_spi_ms5611.c
    const bool accChanged =
        accNotchEnabledApplied != accNotchEnabled ||
        fabsf(accNotchCenterFreqApplied - accNotchCenterFreq) > 0.01f ||
        fabsf(accNotchBandwidthApplied - accNotchBandwidth) > 0.01f;

    if (accChanged)
    {
        for (uint8_t i = 0; i < 3; i++)
        {
            lpf2pInit(&accLpf[i], SENSORS_READ_RATE_HZ, ACCEL_LPF_CUTOFF_FREQ);
            notchFilterInit(&accNotch[i], SENSORS_READ_RATE_HZ, accNotchCenterFreq, accNotchBandwidth);
        }

        accNotchEnabledApplied = accNotchEnabled;
        accNotchCenterFreqApplied = accNotchCenterFreq;
        accNotchBandwidthApplied = accNotchBandwidth;
    }
}

static void sensorsScaleBaro(baro_t *baroScaled) // 气压计读取
{
    float pressure, temperature, asl;
    ms5611GetData(&pressure, &temperature, &asl);
    // ms5611GetData 返回的单位：
    // pressure: mbar (即 hPa)
    // temperature: 摄氏度
    // asl: 米
    baroScaled->pressure = pressure;
    baroScaled->temperature = temperature;
    baroScaled->asl = asl;
}

#ifdef GYRO_ADD_RAW_AND_VARIANCE_LOG_VALUES
LOG_GROUP_START(gyro)
LOG_ADD(LOG_INT16, xRaw, &gyroRaw.x)
LOG_ADD(LOG_INT16, yRaw, &gyroRaw.y)
LOG_ADD(LOG_INT16, zRaw, &gyroRaw.z)
LOG_ADD(LOG_FLOAT, xVariance, &gyroBiasRunning.variance.x)
LOG_ADD(LOG_FLOAT, yVariance, &gyroBiasRunning.variance.y)
LOG_ADD(LOG_FLOAT, zVariance, &gyroBiasRunning.variance.z)
LOG_GROUP_STOP(gyro)
#endif

PARAM_GROUP_START(imu_sensors)
PARAM_ADD(PARAM_UINT8 | PARAM_RONLY, MS5611, &isBarometerPresent)
PARAM_ADD(PARAM_UINT8, skipBaro, &skipBaroCheck)
PARAM_ADD(PARAM_UINT8, gyroNotchEn, &gyroNotchEnabled)
PARAM_ADD(PARAM_FLOAT, gyroNotchHz, &gyroNotchCenterFreq)
PARAM_ADD(PARAM_FLOAT, gyroNotchBw, &gyroNotchBandwidth)
PARAM_ADD(PARAM_UINT8, accNotchEn, &accNotchEnabled)
PARAM_ADD(PARAM_FLOAT, accNotchHz, &accNotchCenterFreq)
PARAM_ADD(PARAM_FLOAT, accNotchBw, &accNotchBandwidth)
PARAM_GROUP_STOP(imu_sensors)
